In [1]:
import matplotlib.pyplot as plt
import seaborn as sns 
import pandas as pd
import numpy as np
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [20]:
df = pd.read_csv(r"C:\Users\Shivaay\Downloads\Compressed\Dataset\data5\Visadataset.csv")

# Top 5 Rows in dataframe

In [21]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

# Bottom 5 rows in dataframe

In [19]:
df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [14]:
df.shape

(25480, 12)

# Printing the data types

In [15]:
df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [17]:
df.memory_usage()

Index                       128
case_id                  203840
continent                203840
education_of_employee    203840
has_job_experience       203840
requires_job_training    203840
no_of_employees          203840
yr_of_estab              203840
region_of_employment     203840
prevailing_wage          203840
unit_of_wage             203840
full_time_position       203840
case_status              203840
dtype: int64

# Finding the Average Salary according to education

In [10]:
df.groupby("education_of_employee")["prevailing_wage"].mean()

education_of_employee
Bachelor's     73405.443735
Doctorate      64561.076657
High School    71582.147756
Master's       78843.057843
Name: prevailing_wage, dtype: float64

# Number of employees according to education

In [11]:
df.groupby("education_of_employee")["no_of_employees"].count()

education_of_employee
Bachelor's     10234
Doctorate       2192
High School     3420
Master's        9634
Name: no_of_employees, dtype: int64

In [76]:
df1 = df[["case_id","education_of_employee","has_job_experience","requires_job_training","no_of_employees","full_time_position","case_status"]]

In [77]:
df1.groupby("education_of_employee")["case_status"].count()

education_of_employee
Bachelor's     10234
Doctorate       2192
High School     3420
Master's        9634
Name: case_status, dtype: int64

In [79]:
df1[(df1["education_of_employee"] == "High School") & (df1["case_status"] == "Denied")]

,case_id,education_of_employee,has_job_experience,requires_job_training,no_of_employees,full_time_position,case_status
0,EZYV01,High School,N,N,14513,Y,Denied
11,EZYV12,High School,Y,N,4069,Y,Denied
15,EZYV16,High School,Y,N,4897,Y,Denied
35,EZYV36,High School,Y,N,5512,Y,Denied
36,EZYV37,High School,Y,N,2520,Y,Denied
...,...,...,...,...,...,...,...
25342,EZYV25343,High School,Y,N,736,Y,Denied
25371,EZYV25372,High School,N,N,776,Y,Denied
25451,EZYV25452,High School,Y,N,97,N,Denied
25452,EZYV25453,High School,N,N,70,Y,Denied
25459,EZYV25460,High School,Y,N,4727,Y,Denied

In [75]:
HighSchool = df1[(df1["education_of_employee"] == "High School") & (df1["case_status"] == "Denied")].count()
HighSchool

case_id                  2256
education_of_employee    2256
has_job_experience       2256
requires_job_training    2256
no_of_employees          2256
case_status              2256
dtype: int64

In [70]:
Bachelors = df1[(df1["education_of_employee"] == "Bachelor's") & (df1["case_status"] == "Denied")].count()
Bachelors

case_id                  3867
education_of_employee    3867
has_job_experience       3867
requires_job_training    3867
no_of_employees          3867
case_status              3867
dtype: int64

In [72]:
Masters = df1[(df1["education_of_employee"] == "Master's") & (df1["case_status"] == "Denied")].count()
Masters

case_id                  2059
education_of_employee    2059
has_job_experience       2059
requires_job_training    2059
no_of_employees          2059
case_status              2059
dtype: int64

In [80]:
Doctrate = df1[(df1["education_of_employee"] == "Doctorate") & (df1["case_status"] == "Denied")].count()

Doctrate

case_id                  280
education_of_employee    280
has_job_experience       280
requires_job_training    280
no_of_employees          280
full_time_position       280
case_status              280
dtype: int64

# Statistics of Data Frame

In [26]:
df.describe()

       no_of_employees   yr_of_estab  prevailing_wage
count     25480.000000  25480.000000     25480.000000
mean       5667.043210   1979.409929     74455.814592
std       22877.928848     42.366929     52815.942327
min         -26.000000   1800.000000         2.136700
25%        1022.000000   1976.000000     34015.480000
50%        2109.000000   1997.000000     70308.210000
75%        3504.000000   2005.000000    107735.512500
max      602069.000000   2016.000000    319210.270000